In [1]:
import numpy as np 
import pandas as pd

## Series

In [4]:
labels = ['a','b','c'] 
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [10]:
ser1 = pd.Series([1,2,3,4],['USA','CHINA','GERMANY','JAPAN'])

In [11]:
ser1

USA        1
CHINA      2
GERMANY    3
JAPAN      4
dtype: int64

In [12]:
ser1['CHINA']

2

In [13]:
ser3 = pd.Series(data = labels)

In [14]:
ser3

0    a
1    b
2    c
dtype: object

In [15]:
ser3[0]

'a'

In [16]:
ser4 = pd.Series([1,2,5,6],['USA','CHINA','ITALY','JAPAN'])

In [17]:
ser4

USA      1
CHINA    2
ITALY    5
JAPAN    6
dtype: int64

In [18]:
ser1 + ser4

CHINA       4.0
GERMANY     NaN
ITALY       NaN
JAPAN      10.0
USA         2.0
dtype: float64

## DataFrames Part  1

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(101)

In [49]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [38]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [39]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [40]:
type(df['W'])

pandas.core.series.Series

In [41]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [42]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [43]:
# add new column 
df['new'] = df['W'] + df['Z']

In [44]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [45]:
df.drop('new',axis = 1,inplace = True) # drop column

In [46]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [47]:
df.drop('E',axis = 0,inplace = True)

In [50]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [52]:
df.shape

(5, 4)

In [53]:
# Select columns 
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [55]:
# Rows  
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [56]:
df.iloc[2]

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

In [58]:
# subsets 
df.loc['B','Y']

-0.031579143908112575

In [59]:
df.loc[['A','B'],['W','Y']] # label

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

In [60]:
df.iloc[2,1] # index

-0.6102588558227414

## DataFrames Part 2

In [62]:
df>0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [63]:
df[df>0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [64]:
df[df['W']>0] # conditional selection

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [66]:
df[df['Z']<0]

          W         X         Y         Z
C  2.154846 -0.610259 -0.755325 -0.346419

In [70]:
df[df['W']>0]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [77]:
df[df['W']>0][['X','Y']]

          X         Y
B -0.156598 -0.031579
C -0.610259 -0.755325
D -0.479448  0.558769

In [80]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y        Z
D  0.147027 -0.479448  0.558769  1.02481

In [81]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [84]:
State = 'CA NY MA CO OR'.split()

In [83]:
'CA NY MA CO'.split()

['CA', 'NY', 'MA', 'CO']

In [85]:
df['State'] = State

In [86]:
df

          W         X         Y         Z State
A -0.993263  0.196800 -1.136645  0.000366    CA
B  1.025984 -0.156598 -0.031579  0.649826    NY
C  2.154846 -0.610259 -0.755325 -0.346419    MA
D  0.147027 -0.479448  0.558769  1.024810    CO
E -0.925874  1.862864 -1.133817  0.610478    OR

In [89]:
df.set_index('State')

              W         X         Y         Z
State
CA    -0.993263  0.196800 -1.136645  0.000366
NY     1.025984 -0.156598 -0.031579  0.649826
MA     2.154846 -0.610259 -0.755325 -0.346419
CO     0.147027 -0.479448  0.558769  1.024810
OR    -0.925874  1.862864 -1.133817  0.610478

## DataFrames Part3

In [90]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [92]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [93]:
inside

[1, 2, 3, 1, 2, 3]

In [94]:
hier_index = list(zip(outside,inside))

In [95]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [96]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [97]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [98]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [99]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [102]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [103]:
df.loc['G1'].iloc[0,1]

2.084018530338962

In [104]:
df.index.names = ['Group','Num']

In [105]:
df

                  A         B
Group Num
G1    1    0.386030  2.084019
      2   -0.376519  0.230336
      3    0.681209  1.035125
G2    1   -0.031160  1.939932
      2   -1.005187 -0.741790
      3    0.187125 -0.732845

In [108]:
df.loc['G2'].loc[2]['B']

-0.7417897046689249

In [109]:
df.xs('G1')

            A         B
Num
1    0.386030  2.084019
2   -0.376519  0.230336
3    0.681209  1.035125

In [111]:
df.xs(1,level = 'Num')  # Cross section

             A         B
Group
G1     0.38603  2.084019
G2    -0.03116  1.939932

## Missing Data

In [112]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [113]:
df = pd.DataFrame(d)

In [114]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [116]:
#drop rows 
df.dropna()

     A    B  C
0  1.0  5.0  1

In [118]:
# drop columns 
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [122]:
df.dropna(thresh= 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [123]:
# fill in missing values 
df.fillna(value = 'Fill In Value')

               A              B  C
0              1              5  1
1              2  Fill In Value  2
2  Fill In Value  Fill In Value  3

In [124]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [126]:
df[['A']]

     A
0  1.0
1  2.0
2  NaN

In [127]:
df[['A']].fillna(value = df[['A']].mean())

     A
0  1.0
1  2.0
2  1.5

## GroupBy

In [128]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [129]:
df = pd.DataFrame(data)

In [130]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [132]:
byComp = df.groupby('Company')

In [133]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [134]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [135]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [136]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [137]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [138]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [145]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging, Joining And Concatenating

In [146]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [147]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [148]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [149]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [150]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [151]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [154]:
# CONCAT  
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [155]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [156]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [157]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [158]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [159]:
# Merge 
pd.merge(left,right,how = 'inner',on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [160]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [161]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [162]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [164]:
pd.merge(left,right,how = 'right',on = ['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [165]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [166]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [167]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [168]:
# Join

In [169]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [170]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [188]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [189]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [173]:
df['col2'].unique()

array([444, 555, 666])

In [174]:
df['col2'].nunique()

3

In [175]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [177]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [178]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [179]:
# apply Function 
def times2(x):
    return x**2

In [180]:
df['col2'].apply(times2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [182]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [183]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [186]:
df.drop('col1',axis = 1,inplace = True ) # axis = 1 column

In [191]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [192]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [193]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [194]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [196]:
df.pivot_table(values= 'D',index = ['A','B'],columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output

In [201]:
pwd

'/Users/chengshengdeng/Desktop/pythonlearning/Py_DS_ML/03-Python-for-Data-Analysis-Pandas'

In [204]:
df = pd.read_csv('hotel_bookings.csv')

In [208]:
df.to_csv('Myoutput',index = False)

In [210]:
df1 = pd.read_csv('Myoutput')

In [220]:
pd.read_excel('Excel_Sample.xlsx',sheet_name= 'Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [221]:
df.to_excel('Excel_Sample2.xlsx',sheet_name = 'NewSheet')

In [222]:
from sqlalchemy import create_engine

In [223]:
engine = create_engine('sqlite:///:memory:')

In [224]:
df.to_sql('my_table',engine)

In [225]:
sqldf = pd.read_sql('my_table',con = engine)